**Link dos arquivos**

https://cdn3.gnarususercontent.com.br/3817-r-tidyverse-2-dplyr/Projeto/Material/Dados/clientes.csv

https://cdn3.gnarususercontent.com.br/3817-r-tidyverse-2-dplyr/Projeto/Material/Dados/transacoes_milhas.csv

https://cdn3.gnarususercontent.com.br/3817-r-tidyverse-2-dplyr/Projeto/Material/Dados/transacoes_passagens.csv

# Conhecendo os dados

In [1]:
library(tidyverse)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.4     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [2]:
transacoes_milhas <- read_csv("/content/transacoes_milhas.csv")

Rows: 1000 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
dbl  (3): id_cliente, milhas_vendidas, valor_recebido
date (1): data_venda_milhas

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [3]:
head(transacoes_milhas)

  id_cliente data_venda_milhas milhas_vendidas valor_recebido
1 350        2023-02-23        4131             536.88
2 109        2022-09-26        6525             113.70
3 376        2022-06-12        9955             466.73
4 443        2022-12-17        5913            1489.56
5 647        2023-10-06         284            1908.38
6 818        2023-05-29        4225            1339.10

In [4]:
transacoes_passagens <- read_csv("/content/transacoes_passagens.csv")

Rows: 1000 Columns: 6
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (1): classe_voo
dbl  (4): id_cliente, milhas_utilizadas, valor_pago, numero_voo
date (1): data_transacao

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [5]:
head(transacoes_passagens)

  id_cliente data_transacao milhas_utilizadas valor_pago classe_voo
1 507        2023-01-30     9837               424.31    Economica
2  86        2023-03-07     6067               513.52    Economica
3 589        2022-02-11     2893              1320.34    Primeira Classe
4 774        2022-09-23     2274              1000.44    Economica
5 705        2023-06-08     6043              1607.35    Economica
6 316        2023-05-13     1798              1802.67    Executiva
  numero_voo
1 3705
2 9504
3 1695
4 2963
5 9190
6 6242

In [6]:
clientes <- read_csv("/content/clientes.csv")

Rows: 1000 Columns: 5
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (1): status_fidelidade
dbl  (3): id_cliente, milhas_acumuladas, gasto_total
date (1): data_nascimento

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [7]:
head(clientes)

  id_cliente data_nascimento status_fidelidade milhas_acumuladas gasto_total
1 1          1971-01-09      Diamante          2833              1906.69
2 2          1996-08-11      Diamante          8864               493.58
3 3          1994-07-18      Diamante           917               519.16
4 4          2003-03-08      Prata             8773              1256.60
5 5          1962-06-05      Diamante          1492               410.37
6 6          1988-02-08      Prata             6270               250.93

In [8]:
transacoes_milhas %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 350, 109, 376, 443, 647, 818, 32, 770, 707, 842, 170…
$ data_venda_milhas <date> 2023-02-23, 2022-09-26, 2022-06-12, 2022-12-17, 202…
$ milhas_vendidas   <dbl> 4131, 6525, 9955, 5913, 284, 4225, 2854, 6127, 5091,…
$ valor_recebido    <dbl> 536.88, 113.70, 466.73, 1489.56, 1908.38, 1339.10, 1…

In [9]:
clientes %>% glimpse()

Rows: 1,000
Columns: 5
$ id_cliente        <dbl> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 1…
$ data_nascimento   <date> 1971-01-09, 1996-08-11, 1994-07-18, 2003-03-08, 196…
$ status_fidelidade <chr> "Diamante", "Diamante", "Diamante", "Prata", "Diaman…
$ milhas_acumuladas <dbl> 2833, 8864, 917, 8773, 1492, 6270, 2583, 8263, 8914,…
$ gasto_total       <dbl> 1906.69, 493.58, 519.16, 1256.60, 410.37, 250.93, 92…

**Para saber mais: Glimpse vs. Head**

No R, ao analisar um conjunto de dados, é fundamental ter uma visão rápida e geral das informações que ele contém. Para isso, utilizamos as funções glimpse() e head().


**Função head()**
A função head() faz parte do conjunto básico de funções do R e permite visualizar as primeiras linhas de um data frame. Por padrão, ela retorna as primeiras seis linhas do conjunto de dados. No entanto, é possível personalizar esse número especificando a quantidade desejada como um argumento da função. Por exemplo, head(data, 10) para exibir as primeiras 10 linhas. Essa função é útil para verificar rapidamente como os dados foram carregados, identificar possíveis problemas ou inconsistências, e ter uma ideia das variáveis disponíveis.


**Função glimpse()**
Já a função glimpse(), que faz parte do pacote dplyr do Tidyverse, oferece uma visão mais detalhada e estruturada do conjunto de dados. Ao utilizar glimpse(data), ela apresenta um resumo das variáveis, mostrando a estrutura de cada coluna (nome, tipo de dado, e uma amostra dos valores contidos). Além disso, glimpse() exibe o número total de linhas e colunas do data frame de forma compacta e amigável, tornando-se muito útil quando você precisa de uma visão geral do seu conjunto de dados sem ter que rolar por uma lista extensa de variáveis, como ocorre com a função str().


**Diferenças e Vantagens**
head(): Fornece apenas as primeiras linhas, útil para ver rapidamente alguns registros e verificar se a importação dos dados foi bem-sucedida.

glimpse(): Dá uma visão mais abrangente, mostrando as variáveis e seus tipos, tornando-a ideal para entender a estrutura e o conteúdo do data frame de forma mais eficiente.
Ao utilizar ambas as funções, você ganha uma visão completa e prática do seu conjunto de dados, facilitando o início de sua análise.

**Para saber mais: Data frame vs. Tibble**

O data frame é uma estrutura de dados fundamental no R, utilizada para armazenar e manipular conjuntos de dados tabulares. Ele é muito semelhante a uma planilha do Excel, onde os dados são organizados em linhas e colunas. Cada coluna em um data frame representa uma variável e cada linha corresponde a uma observação ou registro. As colunas podem conter diferentes tipos de dados, como números, textos ou valores lógicos, o que torna o data frame uma ferramenta muito versátil para análises de dados.

Para criar um data frame no R, você pode usar a função data.frame(). Por exemplo:

In [10]:
dados <- data.frame(
  nome = c("Ana", "Carlos", "Beatriz"),
  idade = c(25, 30, 22),
  salario = c(3000, 4500, 3200)
)

dados

  nome    idade salario
1 Ana     25    3000
2 Carlos  30    4500
3 Beatriz 22    3200

**Tibble**

O tibble é uma versão aprimorada do data frame, oferecida pelo pacote tibble, que faz parte do Tidyverse. Ele foi projetado para superar algumas limitações dos data frames tradicionais, proporcionando uma maneira mais moderna e amigável de trabalhar com dados tabulares.

Aqui estão algumas vantagens do tibble em relação ao data frame:

Visualização mais limpa: Ao exibir um tibble, apenas as primeiras 10 linhas e as colunas que cabem na tela são mostradas, tornando a visualização dos dados mais organizada.

Colunas com tipos de dados consistentes: Diferentemente do data frame, o tibble não converte automaticamente os caracteres em fatores, evitando problemas de tipo de dado.

Manutenção de nomes de coluna: Tibbles permitem nomes de coluna com espaços e caracteres especiais sem problemas, ao contrário do data frame, que ajusta automaticamente os nomes.
Para criar um tibble, você pode utilizar a função tibble() do pacote tibble:

In [11]:
library(tibble)

dados_tibble <- tibble(
  nome = c("Ana", "Carlos", "Beatriz"),
  idade = c(25, 30, 22),
  salario = c(3000, 4500, 3200)
)

dados_tibble

  nome    idade salario
1 Ana     25    3000
2 Carlos  30    4500
3 Beatriz 22    3200

**Diferenças e Vantagens**

Enquanto um data frame tradicional pode ser útil, o tibble é mais flexível, especialmente ao trabalhar com grandes conjuntos de dados.

Tibbles são ideais para a programação moderna em R, principalmente ao utilizar o Tidyverse, facilitando a manipulação e transformação dos dados.

Em resumo, o data frame é a estrutura básica para armazenar dados tabulares no R, enquanto o tibble é uma versão otimizada e aprimorada que traz várias melhorias em termos de usabilidade e eficiência.

In [12]:
transacoes_milhas %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 350, 109, 376, 443, 647, 818, 32, 770, 707, 842, 170…
$ data_venda_milhas <date> 2023-02-23, 2022-09-26, 2022-06-12, 2022-12-17, 202…
$ milhas_vendidas   <dbl> 4131, 6525, 9955, 5913, 284, 4225, 2854, 6127, 5091,…
$ valor_recebido    <dbl> 536.88, 113.70, 466.73, 1489.56, 1908.38, 1339.10, 1…

In [13]:
transacoes_passagens %>% glimpse()

Rows: 1,000
Columns: 6
$ id_cliente        <dbl> 507, 86, 589, 774, 705, 316, 801, 149, 11, 154, 363,…
$ data_transacao    <date> 2023-01-30, 2023-03-07, 2022-02-11, 2022-09-23, 202…
$ milhas_utilizadas <dbl> 9837, 6067, 2893, 2274, 6043, 1798, 4354, 6976, 6344…
$ valor_pago        <dbl> 424.31, 513.52, 1320.34, 1000.44, 1607.35, 1802.67, …
$ classe_voo        <chr> "Economica", "Economica", "Primeira Classe", "Econom…
$ numero_voo        <dbl> 3705, 9504, 1695, 2963, 9190, 6242, 2415, 6747, 3509…

In [14]:
transacoes_passagem <- transacoes_passagens %>%
  select(
  id_cliente,
  data_transacao,
  milhas_utilizadas,
  valor_pago
  )

  transacoes_passagem

     id_cliente data_transacao milhas_utilizadas valor_pago
1    507        2023-01-30     9837               424.31
2     86        2023-03-07     6067               513.52
3    589        2022-02-11     2893              1320.34
4    774        2022-09-23     2274              1000.44
5    705        2023-06-08     6043              1607.35
6    316        2023-05-13     1798              1802.67
7    801        2023-02-19     4354              1309.02
8    149        2022-11-07     6976               309.56
9     11        2023-05-04     6344               140.79
10   154        2023-01-02      257              1359.94
11   363        2023-08-21     5769              1703.59
12   620        2022-08-12     6479              1869.74
13   862        2023-06-01     5196               183.56
14    96        2022-05-23     9444               267.63
15   449        2022-10-16     8102               268.38
16   693        2022-05-24     5335              1678.64
17   242        2022-04-08     7139              1932.91
18   451        2023-09-26     7714               719.61
19   358        2022-09-14     7280              1492.09
20   603        2023-06-30     9108              1542.91
21   951        2023-12-24     8297               746.47
22   372        2023-09-09     6820              1998.67
23   317        2022-05-31     7147              1991.96
24   633        2022-11-14     5738              1953.89
25   524        2022-04-12     1526               506.18
26   798        2022-03-17     6574              1669.93
27   185        2023-12-02     1315               116.35
28   621        2022-12-05     9931               285.85
29   507        2023-04-29     1184               715.96
30   627        2023-07-28     4118               458.88
⋮    ⋮          ⋮              ⋮                 ⋮
971  853        2023-01-29     7333              1209.64
972  184        2022-06-22     6771               775.38
973  497        2022-12-05     9635              1106.50
974  668        2023-03-08     9674              1714.88
975  523        2023-10-26     5397              1323.26
976  875        2023-12-05     7171               926.00
977  827        2023-03-22     5917              1609.66
978  374        2022-06-01     2516              1717.68
979   66        2023-04-04     7610              1972.96
980  271        2023-12-27     5181              1267.00
981  472        2022-06-01     5289              1536.33
982  339        2023-06-21      985               453.96
983  200        2022-11-20     3773              1769.95
984   35        2022-05-13     4427              1440.92
985  811        2022-08-02     6531              1105.61
986  138        2022-07-11     7497               283.44
987  235        2023-03-31     7912              1198.58
988  253        2022-12-24     4487              1678.98
989  966        2023-02-03     1891              1808.77
990  813        2023-03-14     5380               736.21
991  462        2023-05-19     8078               913.16
992  253        2023-02-03     6339              1093.25
993  711        2022-08-14     9977              1965.73
994   67        2022-07-20     7458               252.18
995  191        2023-03-26     3740              1846.43
996  586        2022-07-29     2519               940.10
997  139        2023-08-24     4166              1291.72
998  582        2023-12-29     2193               334.13
999  564        2022-02-20     2910               137.68
1000 837        2023-02-02     7675              1635.14

In [15]:
transacoes_passagem %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 507, 86, 589, 774, 705, 316, 801, 149, 11, 154, 363,…
$ data_transacao    <date> 2023-01-30, 2023-03-07, 2022-02-11, 2022-09-23, 202…
$ milhas_utilizadas <dbl> 9837, 6067, 2893, 2274, 6043, 1798, 4354, 6976, 6344…
$ valor_pago        <dbl> 424.31, 513.52, 1320.34, 1000.44, 1607.35, 1802.67, …

In [16]:
transacoes_milhas <- transacoes_milhas %>%
  filter(data_venda_milhas >= "2022-01-01" & data_venda_milhas <= "2022-12-31")

In [17]:
transacoes_milhas %>% glimpse()

Rows: 485
Columns: 4
$ id_cliente        <dbl> 109, 376, 443, 32, 842, 609, 391, 600, 101, 761, 959…
$ data_venda_milhas <date> 2022-09-26, 2022-06-12, 2022-12-17, 2022-12-06, 202…
$ milhas_vendidas   <dbl> 6525, 9955, 5913, 2854, 5686, 937, 1190, 8295, 635, …
$ valor_recebido    <dbl> 113.70, 466.73, 1489.56, 1983.85, 191.69, 183.50, 47…

In [18]:
transacoes_passagens <- transacoes_passagens %>%
  filter(data_transacao >= "2022-01-01" & data_transacao <= "2022-12-31")

In [19]:
transacoes_passagens %>%  glimpse()

Rows: 502
Columns: 6
$ id_cliente        <dbl> 589, 774, 149, 620, 96, 449, 693, 242, 358, 317, 633…
$ data_transacao    <date> 2022-02-11, 2022-09-23, 2022-11-07, 2022-08-12, 202…
$ milhas_utilizadas <dbl> 2893, 2274, 6976, 6479, 9444, 8102, 5335, 7139, 7280…
$ valor_pago        <dbl> 1320.34, 1000.44, 309.56, 1869.74, 267.63, 268.38, 1…
$ classe_voo        <chr> "Primeira Classe", "Economica", "Primeira Classe", "…
$ numero_voo        <dbl> 1695, 2963, 6747, 7699, 3939, 4187, 9581, 3641, 4839…

In [20]:
transacoes_passagens <- transacoes_passagens %>%
  mutate(
    custo_por_milha = valor_pago / milhas_utilizadas
  )

In [21]:
transacoes_passagens %>% glimpse()

Rows: 502
Columns: 7
$ id_cliente        <dbl> 589, 774, 149, 620, 96, 449, 693, 242, 358, 317, 633…
$ data_transacao    <date> 2022-02-11, 2022-09-23, 2022-11-07, 2022-08-12, 202…
$ milhas_utilizadas <dbl> 2893, 2274, 6976, 6479, 9444, 8102, 5335, 7139, 7280…
$ valor_pago        <dbl> 1320.34, 1000.44, 309.56, 1869.74, 267.63, 268.38, 1…
$ classe_voo        <chr> "Primeira Classe", "Economica", "Primeira Classe", "…
$ numero_voo        <dbl> 1695, 2963, 6747, 7699, 3939, 4187, 9581, 3641, 4839…
$ custo_por_milha   <dbl> 0.45639129, 0.43994723, 0.04437500, 0.28858466, 0.02…

In [22]:
media_milhas <- transacoes_passagens %>%
  group_by(id_cliente) %>%
  summarise(media_milhas = mean(milhas_utilizadas))

In [23]:
 media_milhas %>% head()

  id_cliente media_milhas
1  3         1023.0
2  7         7074.5
3 10         6537.0
4 12         9312.0
5 13         4123.0
6 15         7541.0

# Organizando combinando e filtrando data frames

In [24]:
transacoes_passagens %>%
  head()

  id_cliente data_transacao milhas_utilizadas valor_pago classe_voo
1 589        2022-02-11     2893              1320.34    Primeira Classe
2 774        2022-09-23     2274              1000.44    Economica
3 149        2022-11-07     6976               309.56    Primeira Classe
4 620        2022-08-12     6479              1869.74    Economica
5  96        2022-05-23     9444               267.63    Executiva
6 449        2022-10-16     8102               268.38    Primeira Classe
  numero_voo custo_por_milha
1 1695       0.45639129
2 2963       0.43994723
3 6747       0.04437500
4 7699       0.28858466
5 3939       0.02833863
6 4187       0.03312515

In [25]:
transacoes_passagens <- transacoes_passagens %>%
  arrange(data_transacao)

In [26]:
transacoes_passagens %>%
  head()

  id_cliente data_transacao milhas_utilizadas valor_pago classe_voo
1 967        2022-01-01     1198              1217.17    Economica
2 747        2022-01-01     8451              1064.09    Executiva
3 237        2022-01-01     7996              1684.94    Primeira Classe
4 504        2022-01-02     6143               692.94    Economica
5 840        2022-01-02     5267              1496.54    Economica
6 396        2022-01-02     1929               760.04    Primeira Classe
  numero_voo custo_por_milha
1 9302       1.0160017
2 2381       0.1259129
3  704       0.2107229
4 6913       0.1128016
5 9066       0.2841352
6 9482       0.3940073

In [27]:
transacoes_milhas %>% head()

  id_cliente data_venda_milhas milhas_vendidas valor_recebido
1 109        2022-09-26        6525             113.70
2 376        2022-06-12        9955             466.73
3 443        2022-12-17        5913            1489.56
4  32        2022-12-06        2854            1983.85
5 842        2022-05-29        5686             191.69
6 609        2022-11-09         937             183.50

In [28]:
transacoes_milhas <- transacoes_milhas %>%
  arrange(data_venda_milhas)

In [29]:
transacoes_milhas %>% head()

  id_cliente data_venda_milhas milhas_vendidas valor_recebido
1 619        2022-01-01        4385            1836.72
2 323        2022-01-01        8808            1023.11
3 963        2022-01-01        6560            1883.39
4 745        2022-01-02        4810            1685.14
5 299        2022-01-02        1916             988.58
6 797        2022-01-02        3026            1970.48

In [30]:
clientes %>%
  head()

  id_cliente data_nascimento status_fidelidade milhas_acumuladas gasto_total
1 1          1971-01-09      Diamante          2833              1906.69
2 2          1996-08-11      Diamante          8864               493.58
3 3          1994-07-18      Diamante           917               519.16
4 4          2003-03-08      Prata             8773              1256.60
5 5          1962-06-05      Diamante          1492               410.37
6 6          1988-02-08      Prata             6270               250.93

In [31]:
transacoes_passagens <- transacoes_passagens %>% left_join(clientes, by="id_cliente")

In [32]:
transacoes_passagens %>%
  head()

  id_cliente data_transacao milhas_utilizadas valor_pago classe_voo
1 967        2022-01-01     1198              1217.17    Economica
2 747        2022-01-01     8451              1064.09    Executiva
3 237        2022-01-01     7996              1684.94    Primeira Classe
4 504        2022-01-02     6143               692.94    Economica
5 840        2022-01-02     5267              1496.54    Economica
6 396        2022-01-02     1929               760.04    Primeira Classe
  numero_voo custo_por_milha data_nascimento status_fidelidade
1 9302       1.0160017       1963-12-21      Prata
2 2381       0.1259129       1967-04-16      Diamante
3  704       0.2107229       1961-07-17      Ouro
4 6913       0.1128016       1999-02-14      Diamante
5 9066       0.2841352       1983-12-04      Ouro
6 9482       0.3940073       1972-06-30      Diamante
  milhas_acumuladas gasto_total
1 7635               710.17
2 1952               706.99
3 5529              1002.03
4 8871               922.06
5 9589              1987.85
6 2142               285.24

In [33]:
transacoes_passagens %>% glimpse()

Rows: 502
Columns: 11
$ id_cliente        <dbl> 967, 747, 237, 504, 840, 396, 108, 893, 755, 166, 71…
$ data_transacao    <date> 2022-01-01, 2022-01-01, 2022-01-01, 2022-01-02, 202…
$ milhas_utilizadas <dbl> 1198, 8451, 7996, 6143, 5267, 1929, 8740, 6757, 6792…
$ valor_pago        <dbl> 1217.17, 1064.09, 1684.94, 692.94, 1496.54, 760.04, …
$ classe_voo        <chr> "Economica", "Executiva", "Primeira Classe", "Econom…
$ numero_voo        <dbl> 9302, 2381, 704, 6913, 9066, 9482, 3372, 1150, 2190,…
$ custo_por_milha   <dbl> 1.01600167, 0.12591291, 0.21072286, 0.11280156, 0.28…
$ data_nascimento   <date> 1963-12-21, 1967-04-16, 1961-07-17, 1999-02-14, 198…
$ status_fidelidade <chr> "Prata", "Diamante", "Ouro", "Diamante", "Ouro", "Di…
$ milhas_acumuladas <dbl> 7635, 1952, 5529, 8871, 9589, 2142, 4546, 5081, 2642…
$ gasto_total       <dbl> 710.17, 706.99, 1002.03, 922.06, 1987.85, 285.24, 19…

**Para saber mais: tipos de joins no dplyr**

**Inner Join (inner_join)**

O inner_join retorna apenas as linhas que possuem correspondências nas duas tabelas. Se não houver correspondência, as linhas são descartadas.

In [34]:
# data frames de exemplo
clientes_exemplo <- data.frame(ID_cliente = c(1, 2, 3, 4),
                       nome = c("Alice", "Bruno", "Carlos", "Diana"))

compras_exemplo <- data.frame(ID_cliente = c(2, 3, 5),
                      produto = c("Livro", "Caderno", "Caneta"))

In [35]:
clientes_exemplo %>% head()

  ID_cliente nome
1 1          Alice
2 2          Bruno
3 3          Carlos
4 4          Diana

In [36]:
compras_exemplo %>% head()

  ID_cliente produto
1 2          Livro
2 3          Caderno
3 5          Caneta

In [37]:
# Aplicando o inner_join
inner <- inner_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(inner)

  ID_cliente   nome produto
1          2  Bruno   Livro
2          3 Carlos Caderno

**Left Join (left_join)**

O left_join retorna todas as linhas da tabela da esquerda (primeira tabela) e as correspondências da tabela da direita (segunda tabela). Se não houver correspondência, os valores da tabela da direita serão NA.

In [38]:
# Aplicando o left_join
left <- left_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(left)

  ID_cliente   nome produto
1          1  Alice    <NA>
2          2  Bruno   Livro
3          3 Carlos Caderno
4          4  Diana    <NA>

**Right Join (right_join)**

O right_join retorna todas as linhas da tabela da direita (segunda tabela) e as correspondências da tabela da esquerda (primeira tabela). Onde não houver correspondência, os valores da tabela da esquerda serão NA.

In [39]:
# Aplicando o right_join
right <- right_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(right)

  ID_cliente   nome produto
1          2  Bruno   Livro
2          3 Carlos Caderno
3          5   <NA>  Caneta

**Full Join (full_join)**

O full_join retorna todas as linhas das duas tabelas, preenchendo com NA onde não houver correspondência.

In [40]:
# Aplicando o full_join
full <- full_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(full)

  ID_cliente   nome produto
1          1  Alice    <NA>
2          2  Bruno   Livro
3          3 Carlos Caderno
4          4  Diana    <NA>
5          5   <NA>  Caneta

**Semi Join (semi_join)**

O semi_join retorna todas as linhas da tabela da esquerda que possuem correspondências na tabela da direita, mas apenas as colunas da tabela da esquerda.

In [41]:
# Aplicando o semi_join
semi <- semi_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(semi)

  ID_cliente   nome
1          2  Bruno
2          3 Carlos

**Anti Join (anti_join)**

O anti_join retorna as linhas da tabela da esquerda que não possuem correspondências na tabela da direita.

In [42]:
# Aplicando o anti_join
anti <- anti_join(clientes_exemplo, compras_exemplo, by = "ID_cliente")
print(anti)

  ID_cliente  nome
1          1 Alice
2          4 Diana

**Resumo**

**inner_join:** Retorna apenas as correspondências de ambas as tabelas.

**left_join:** Retorna todas as linhas da tabela da esquerda com as correspondências da direita.

**right_join:** Retorna todas as linhas da tabela da direita com as correspondências da esquerda.

**full_join:** Retorna todas as linhas de ambas as tabelas, preenchendo com NA onde não houver correspondência.

**semi_join:** Retorna apenas as linhas da tabela da esquerda que possuem correspondências na tabela da direita.

**anti_join:** Retorna apenas as linhas da tabela da esquerda que não possuem correspondências na tabela da direita.

**Renomear colunas**

In [43]:
transacoes_passagens <- transacoes_passagens %>%
  rename(
  Data_Compra_Passagem = data_transacao,
  Milhas_Utilizadas = milhas_utilizadas,
  Valor_Pago = valor_pago,
  Custo_Por_Milha = custo_por_milha,
  Data_Nascimento = data_nascimento,
  Status_Fidelidade = status_fidelidade,
  Milhas_Acumuladas = milhas_acumuladas,
  Gasto_Total = gasto_total
  )

In [44]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1 967        2022-01-01           1198              1217.17    Economica
2 747        2022-01-01           8451              1064.09    Executiva
3 237        2022-01-01           7996              1684.94    Primeira Classe
4 504        2022-01-02           6143               692.94    Economica
5 840        2022-01-02           5267              1496.54    Economica
6 396        2022-01-02           1929               760.04    Primeira Classe
  numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1 9302       1.0160017       1963-12-21      Prata
2 2381       0.1259129       1967-04-16      Diamante
3  704       0.2107229       1961-07-17      Ouro
4 6913       0.1128016       1999-02-14      Diamante
5 9066       0.2841352       1983-12-04      Ouro
6 9482       0.3940073       1972-06-30      Diamante
  Milhas_Acumuladas Gasto_Total
1 7635               710.17
2 1952               706.99
3 5529              1002.03
4 8871               922.06
5 9589              1987.85
6 2142               285.24

In [45]:
transacoes_passagens %>%
  count(id_cliente) %>%
  rename(Total_Compras=n) %>%
  arrange(desc(Total_Compras)) %>%
  head()

  id_cliente Total_Compras
1 586        5
2 544        4
3 861        4
4 175        3
5 207        3
6 239        3

# Aplicando técnicas de transformação de dados

**Contar número de compras por cliente**

In [46]:
dados_milhas <- transacoes_passagens %>%
  select(id_cliente, Milhas_Utilizadas)

In [47]:
dados_milhas %>% head()

  id_cliente Milhas_Utilizadas
1 967        1198
2 747        8451
3 237        7996
4 504        6143
5 840        5267
6 396        1929

In [48]:
total_de_milhas_por_cliente <- dados_milhas %>%
  group_by(id_cliente) %>%
  summarise(total_milhas = sum(Milhas_Utilizadas))

In [49]:
total_de_milhas_por_cliente %>% head()

  id_cliente total_milhas
1  3          1023
2  7         14149
3 10          6537
4 12          9312
5 13          4123
6 15          7541

In [50]:
total_de_milhas_por_cliente %>%
    arrange(desc(total_milhas)) %>%
    head()

  id_cliente total_milhas
1 544        28726
2 572        22209
3 890        19566
4  96        19047
5 945        18514
6  32        18126

**Criação de novas colunas e classificação**

Categorização de Clientes por Milhas Utilizadas:

No dataset de transações, os clientes podem ser categorizados em três grupos com base no número de **Milhas Utilizadas** nas transações:

- **Baixo**: Clientes que utilizaram **menos de 2.000 milhas**.
- **Médio**: Clientes que utilizaram **entre 2.000 e 4.999 milhas**.
- **Alto**: Clientes que utilizaram **5.000 milhas ou mais**.

Essa categorização facilita a análise do perfil de consumo de milhas, ajudando a segmentar clientes de acordo com seu volume de uso.

In [51]:
transacoes_passagens <- transacoes_passagens %>% mutate(categoria_cliente = case_when(
  Milhas_Utilizadas < 2000 ~ 'Baixo',
  Milhas_Utilizadas < 5000 ~ 'Médio',
  TRUE ~ 'Alto'
))

In [52]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1 967        2022-01-01           1198              1217.17    Economica
2 747        2022-01-01           8451              1064.09    Executiva
3 237        2022-01-01           7996              1684.94    Primeira Classe
4 504        2022-01-02           6143               692.94    Economica
5 840        2022-01-02           5267              1496.54    Economica
6 396        2022-01-02           1929               760.04    Primeira Classe
  numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1 9302       1.0160017       1963-12-21      Prata
2 2381       0.1259129       1967-04-16      Diamante
3  704       0.2107229       1961-07-17      Ouro
4 6913       0.1128016       1999-02-14      Diamante
5 9066       0.2841352       1983-12-04      Ouro
6 9482       0.3940073       1972-06-30      Diamante
  Milhas_Acumuladas Gasto_Total categoria_cliente
1 7635               710.17     Baixo
2 1952               706.99     Alto
3 5529              1002.03     Alto
4 8871               922.06     Alto
5 9589              1987.85     Alto
6 2142               285.24     Baixo

# Entendendo o comportamento do cliente

**Diferença de milhas e previsão**

In [54]:
transacoes_passagens <- transacoes_passagens %>%
  arrange(id_cliente, Data_Compra_Passagem) %>%
  group_by(id_cliente) %>%
  mutate(
  diferenca_milhas_usadas = Milhas_Utilizadas - lag(Milhas_Utilizadas),
  diferenca_valor_futuro = lead(Milhas_Utilizadas)
  ) %>%
    ungroup()

In [55]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1  3         2022-03-24           1023              1588.11    Executiva
2  7         2022-09-16           9449              1906.01    Executiva
3  7         2022-12-07           4700              1285.88    Economica
4 10         2022-06-07           6537               469.28    Primeira Classe
5 12         2022-10-29           9312               570.34    Executiva
6 13         2022-09-07           4123               240.23    Primeira Classe
  numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1 5616       1.55240469      1994-07-18      Diamante
2 2232       0.20171553      1972-08-06      Diamante
3 4947       0.27359149      1972-08-06      Diamante
4  242       0.07178828      1980-03-12      Bronze
5 3599       0.06124785      1978-10-09      Diamante
6 8707       0.05826583      1996-12-31      Ouro
  Milhas_Acumuladas Gasto_Total categoria_cliente diferenca_milhas_usadas
1  917               519.16     Baixo                NA
2 2583               924.60     Alto                 NA
3 2583               924.60     Médio             -4749
4 3829               595.78     Alto                 NA
5 8857              1310.66     Alto                 NA
6 2228              1316.16     Médio                NA
  diferenca_valor_futuro
1   NA
2 4700
3   NA
4   NA
5   NA
6   NA

**Filtragem e tratamento de valores ausentes**

In [56]:
any(is.na(transacoes_passagens))

[1] TRUE

In [57]:
sum(is.na(transacoes_passagens))

[1] 788

In [58]:
num_clientes <- transacoes_passagens %>%
  summarise(numero_clientes = n_distinct(id_cliente))

In [59]:
num_clientes

  numero_clientes
1 394

In [60]:
num_clientes * 2

  numero_clientes
1 788

In [64]:
transacoes_passagens <- transacoes_passagens %>%
  mutate(
  diferenca_milhas_usadas = coalesce(diferenca_milhas_usadas, 0),
  diferenca_valor_futuro = coalesce(diferenca_valor_futuro, 0)
  )

In [65]:
any(is.na(transacoes_passagens))

[1] FALSE

In [67]:
transacoes_passagens %>%
  arrange(desc(diferenca_milhas_usadas)) %>%
  head(10)

   id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1  625        2022-12-30           7566              1890.54    Economica
2  961        2022-12-30           7215               594.29    Primeira Classe
3  151        2022-08-28           8923               689.02    Executiva
4  820        2022-11-09           9658               472.85    Economica
5  807        2022-10-24           7239               361.49    Executiva
6  370        2022-09-23           8858               884.50    Primeira Classe
7  586        2022-11-20           9478              1070.43    Executiva
8  945        2022-12-19           7559              1441.52    Primeira Classe
9  332        2022-09-13           8010              1669.10    Executiva
10 524        2022-05-01           7567              1649.38    Primeira Classe
   numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1  8295       0.24987312      1971-12-03      Bronze
2  9929       0.08236868      2005-03-17      Ouro
3  9823       0.07721842      1990-04-19      Ouro
4  9134       0.04895941      1995-10-31      Diamante
5  9475       0.04993646      1991-07-08      Diamante
6  8801       0.09985324      1988-11-02      Bronze
7  3963       0.11293838      1967-06-08      Ouro
8  7551       0.19070247      1988-04-26      Prata
9   282       0.20837703      2002-04-14      Prata
10 9751       0.21797013      2000-08-16      Ouro
   Milhas_Acumuladas Gasto_Total categoria_cliente diferenca_milhas_usadas
1  2787               897.42     Alto              7122
2  1488              1011.49     Alto              7095
3  6262              1087.80     Alto              7009
4  3916              1843.98     Alto              6848
5  9252              1515.46     Alto              6740
6  5013              1905.95     Alto              6545
7   463               980.86     Alto              6222
8  5547              1801.21     Alto              6143
9  4243               920.32     Alto              6112
10 1139              1031.52     Alto              6041
   diferenca_valor_futuro
1  0
2  0
3  0
4  0
5  0
6  0
7  0
8  0
9  0
10 0

In [68]:
transacoes_passagens %>%
  arrange(desc(diferenca_valor_futuro)) %>%
  head(10)

   id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1  912        2022-05-11           4572               494.11    Primeira Classe
2  685        2022-06-19           4529              1612.55    Economica
3  371        2022-03-03           5410               143.81    Executiva
4  820        2022-07-06           2810              1540.07    Executiva
5  890        2022-02-01           9951               637.93    Economica
6  586        2022-09-06           3256               357.72    Executiva
7   96        2022-03-14           9603              1917.23    Primeira Classe
8  548        2022-02-19           6482               687.07    Primeira Classe
9  144        2022-05-08           6847              1435.24    Economica
10 583        2022-01-29           5653               435.02    Executiva
   numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1  2261       0.10807305      1962-02-02      Diamante
2  7891       0.35604990      1980-05-05      Bronze
3   227       0.02658226      1988-09-22      Prata
4  2676       0.54806762      1995-10-31      Diamante
5  7899       0.06410712      1974-03-14      Diamante
6  4575       0.10986486      1967-06-08      Ouro
7  3794       0.19964907      1960-08-13      Prata
8  7553       0.10599661      1977-10-19      Ouro
9  7827       0.20961589      1981-08-02      Ouro
10 2525       0.07695383      1971-01-03      Ouro
   Milhas_Acumuladas Gasto_Total categoria_cliente diferenca_milhas_usadas
1  1929              1788.99     Médio               0
2  4673              1553.53     Médio               0
3  7580              1834.72     Alto                0
4  3916              1843.98     Médio               0
5   900              1615.20     Alto                0
6   463               980.86     Médio             737
7  8772               406.40     Alto                0
8  2011               943.66     Alto                0
9  4620              1300.02     Alto                0
10 9373               619.76     Alto                0
   diferenca_valor_futuro
1  9910
2  9755
3  9720
4  9658
5  9615
6  9478
7  9444
8  9317
9  9275
10 8997

In [ ]:
# Impulsionando o crescimento com análise de clientes

**Classificar clientes com case_when e recode**

In [69]:
transacoes_passagens <- transacoes_passagens %>%
  mutate(categoria_cliente =
  recode(categoria_cliente,
"Baixo" = "Iniciante",
"Médio" = "Intermediário",
"Alto" = "Avançado")
)

In [70]:
transacoes_passagens %>% head(10)

   id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago classe_voo
1   3         2022-03-24           1023              1588.11    Executiva
2   7         2022-09-16           9449              1906.01    Executiva
3   7         2022-12-07           4700              1285.88    Economica
4  10         2022-06-07           6537               469.28    Primeira Classe
5  12         2022-10-29           9312               570.34    Executiva
6  13         2022-09-07           4123               240.23    Primeira Classe
7  15         2022-07-19           7541              1377.39    Economica
8  23         2022-03-04           6121              1092.10    Primeira Classe
9  26         2022-03-11           8204              1558.04    Primeira Classe
10 26         2022-04-04           8161               423.71    Executiva
   numero_voo Custo_Por_Milha Data_Nascimento Status_Fidelidade
1  5616       1.55240469      1994-07-18      Diamante
2  2232       0.20171553      1972-08-06      Diamante
3  4947       0.27359149      1972-08-06      Diamante
4   242       0.07178828      1980-03-12      Bronze
5  3599       0.06124785      1978-10-09      Diamante
6  8707       0.05826583      1996-12-31      Ouro
7   870       0.18265349      1964-03-25      Ouro
8  9804       0.17841856      1973-01-16      Prata
9  3551       0.18991224      1975-02-07      Bronze
10 2918       0.05191888      1975-02-07      Bronze
   Milhas_Acumuladas Gasto_Total categoria_cliente diferenca_milhas_usadas
1   917               519.16     Iniciante             0
2  2583               924.60     Avançado              0
3  2583               924.60     Intermediário     -4749
4  3829               595.78     Avançado              0
5  8857              1310.66     Avançado              0
6  2228              1316.16     Intermediário         0
7  1513               183.81     Avançado              0
8  6208               720.28     Avançado              0
9  3053              1170.27     Avançado              0
10 3053              1170.27     Avançado            -43
   diferenca_valor_futuro
1     0
2  4700
3     0
4     0
5     0
6     0
7     0
8     0
9  8161
10    0

**Transformar colunas em linhas com pivot_longer**

In [72]:
transacoes_passagens %>%
  select(id_cliente, Milhas_Utilizadas, Milhas_Acumuladas) %>%
  head()

  id_cliente Milhas_Utilizadas Milhas_Acumuladas
1  3         1023               917
2  7         9449              2583
3  7         4700              2583
4 10         6537              3829
5 12         9312              8857
6 13         4123              2228

In [73]:
df_long <- transacoes_passagens %>%
  pivot_longer(
  cols = starts_with("Milhas"),
  names_to = "tipo_milhas",
  values_to = "quantidade"
  ) %>%
    select(id_cliente, tipo_milhas, quantidade)

In [74]:
df_long %>% head()

  id_cliente tipo_milhas       quantidade
1 3          Milhas_Utilizadas 1023
2 3          Milhas_Acumuladas  917
3 7          Milhas_Utilizadas 9449
4 7          Milhas_Acumuladas 2583
5 7          Milhas_Utilizadas 4700
6 7          Milhas_Acumuladas 2583

In [79]:
df_long %>%
  group_by(tipo_milhas) %>%
  summarise(
  media = mean(quantidade),
  mediana = median(quantidade),
  desvio_padrao = sd(quantidade),
  )

  tipo_milhas       media    mediana desvio_padrao
1 Milhas_Acumuladas 5028.865 4926.5  2916.979
2 Milhas_Utilizadas 5112.629 5260.5  2793.163

**Documentação R**

O link para a documentação do R sobre estruturas de dados oferece uma visão geral das diferentes estruturas disponíveis na linguagem, como vetores, listas, data frames e matrizes. A documentação inclui exemplos práticos, guias para iniciantes, e explicações detalhadas sobre como utilizar e manipular essas estruturas de dados em R. É uma fonte tanto para quem está começando na programação em R quanto para pessoas mais experientes, fornecendo informações para a análise e visualização de dados.

https://cran.r-project.org/doc/manuals/r-release/R-intro.html#Lists-and-data-frames

**Documentação dplyr**

A página da biblioteca dplyr do R, parte do tidyverse, oferece uma excelente referência para quem está aprendendo manipulação de dados com essa linguagem de programação. Ela descreve a gramática de manipulação de dados da dplyr, com verbos consistentes para as tarefas mais comuns, como adicionar novas variáveis, selecionar colunas, filtrar linhas, sumarizar dados e ordenar registros.

https://dplyr.tidyverse.org/